#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.create_role will be created
  + resource "aws_iam_policy" "create_role" {
      + arn         = (known after apply)
      + description = "Policy that allows the creation of roles"
      + id          = (known after apply)
      + name        = "CreateRoles"
      + name_prefix = (known after apply)
      + path        = "/IacGhcPipelineResourceManagerPolicy/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:PutRolePolicy",
                          + "iam:CreateRole",
                          + "iam:AttachRolePolicy",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::*:role/IacGhcPipelineResourceManagerRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Developer"      = "StratusGrid"
          + "Environment"    = "dev"
          + "Provisioner"    = "Terraform"
          + "Region_Purpose" = "Active"
          + "SourceRepo"     = "https://github.com/jasonlll88/test-account-starter-permissions"
          + "Terraform"      = "true"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>
            

*Pusher: @jheison-rodriguez, Action: `pull_request`, Working Directory: `/home/runner/work/example-terraform-account-starter-implementation/example-terraform-account-starter-implementation`, Workflow: `Terraform Deployment`*
